<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"2e5570a8391d46351270ff9799c79518f675b86ed2c4dc0cf8ac62a3fccd7be8","plan_job_ref":"Job Create terraform plan for Palo Alto Panorama Add-on #24 at https://github.com/AFMPE/mpe_palo_alto/actions/runs/7659262425","plan_hash":"e6dc2cd81f402bcc84741296806d77d5817a4ba5f79d23dcdfd21a752f86d102","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __infrastructure/terraform__
With backend config: `storage_account_name=afmpetfmgtprodh9df3erta
container_name=paloalto            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `infrastructure/terraform/tfvars/parameters.tfvars
`<details open><summary>With variables</summary>

```hcl
jumpbox_vm_admin_password         = (sensitive value)
panorama_vm_admin_ssh_private_key = (sensitive value)
panorama_vm_admin_ssh_public_key  = (sensitive value)
production_subscription_id        = (sensitive value)
spoke_subscription_id             = (sensitive value)
```
</details>
<details>
<summary>Plan: 6 to add, 0 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_key_vault_secret.panorama-server-ssh-key will be created
  + resource "azurerm_key_vault_secret" "panorama-server-ssh-key" {
      + id                      = (known after apply)
      + key_vault_id            = "*********************************************************************************************************************************************************"
      + name                    = "Panorama-Server-SSH-Key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.data.azurenoopsutils_resource_name.computer_windows will be read during apply
  # (config refers to values not yet known)
 <= data "azurenoopsutils_resource_name" "computer_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = (known after apply)
      + prefixes      = [
          + "ampe",
          + "eus",
        ]
      + resource_type = "azurerm_windows_virtual_machine"
      + result        = (known after apply)
      + separator     = "-"
      + suffixes      = [
          + "prod",
        ]
      + use_slug      = true
    }

  # module.mod_jumpbox_virtual_machine.azurerm_network_interface.nic[0] must be replaced
-/+ resource "azurerm_network_interface" "nic" {
      ~ applied_dns_servers           = [] -> (known after apply)
      ~ id                            = "***********************************************************************************************************************************************************************" -> (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      ~ mac_address                   = "00-0D-3A-1D-51-9A" -> (known after apply)
      ~ name                          = "ampe-eus-panorama-jumpbox-prod-nic" -> "ampe-eus-panorama-jmpbox-prod-nic" # forces replacement
      ~ private_ip_address            = "192.168.1.5" -> (known after apply)
      ~ private_ip_addresses          = [
          - "192.168.1.5",
        ] -> (known after apply)
      ~ tags                          = {
          ~ "ResourceName" = "ampe-eus-panorama-jumpbox-prod-nic" -> "ampe-eus-panorama-jmpbox-prod-nic"
            "deployedBy"   = "AzureNoOpsTF [default]"
            "env"          = "prod"
            "workload"     = "panorama"
        }
      + virtual_machine_id            = (known after apply)
        # (5 unchanged attributes hidden)

      ~ ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
            name                                               = "ipconfig-vmnicipconfig1"
          ~ private_ip_address                                 = "192.168.1.5" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.mod_jumpbox_virtual_machine.azurerm_network_interface_security_group_association.nsgassoc[0] must be replaced
-/+ resource "azurerm_network_interface_security_group_association" "nsgassoc" {
      ~ id                        = "***********************************************************************************************************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
      ~ network_interface_id      = "/subscriptions/6de24b6c-e2f1-4cad-a222-3512b49eeb49/resourceGroups/ampe-eus-id-prod-rg/providers/Microsoft.Network/networkInterfaces/ampe-eus-panorama-jumpbox-prod-nic" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_virtual_machine_extension.omsagentwin[0] will be created
  + resource "azurerm_virtual_machine_extension" "omsagentwin" {
      + auto_upgrade_minor_version  = true
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "OmsAgentForWindows"
      + protected_settings          = (sensitive value)
      + publisher                   = "Microsoft.EnterpriseCloud.Monitoring"
      + settings                    = <<-EOT
            {
                  "workspaceId": "f4a6b291-6836-4823-8dba-d73fa97701fa"
                }
        EOT
      + type                        = "MicrosoftMonitoringAgent"
      + type_handler_version        = "1.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.mod_jumpbox_virtual_machine.azurerm_windows_virtual_machine.win_vm[0] will be created
  + resource "azurerm_windows_virtual_machine" "win_vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "azureadmin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + enable_automatic_updates                               = false
      + encryption_at_host_enabled                             = false
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = false
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "ampe-eus-panorama-jmpbox"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "AutomaticByPlatform"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "ampe-eus-id-prod-rg"
      + size                                                   = "Standard_D16ls_v5"
      + tags                                                   = {
          + "ResourceName" = "ampe-eus-panora"
          + "deployedBy"   = "AzureNoOpsTF [default]"
          + "env"          = "prod"
          + "workload"     = "panorama"
        }
      + virtual_machine_id                                     = (known after apply)

      + additional_capabilities {
          + ultra_ssd_enabled = false
        }

      + boot_diagnostics {}

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }
    }

  # module.mod_jumpbox_virtual_machine.random_id.uniqueString must be replaced
-/+ resource "random_id" "uniqueString" {
      ~ b64_std     = "********" -> (known after apply)
      ~ b64_url     = "*******" -> (known after apply)
      ~ dec         = "***********" -> (known after apply)
      ~ hex         = "**********" -> (known after apply)
      ~ id          = "*******" -> (known after apply)
      ~ keepers     = { # forces replacement
          ~ "subid"      = "panorama-jumpbox" -> "panorama-jmpbox"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan for Palo Alto Panorama Add-on #24](https://github.com/AFMPE/mpe_palo_alto/actions/runs/7659262425)